app/controllers/todo_lists_controller.rb

  def index
    @todo_lists = TodoList.all
     if params[:undo].present?
      @todo_lists = @todo_lists.where(:finished => false)
---
SELECT "todo_lists".* FROM "todo_lists"
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."finished" = 'f'

  def create
    @todo_list = TodoList.new(todo_list_params)

    respond_to do |format|
      if @todo_list.save
---
INSERT INTO "todo_lists" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test"], ["description", "test"], ["created_at", "2015-04-26 03:41:16.913464"], ["updated_at", "2015-04-26 03:41:16.913464"]]